; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 ball box - object_
 )
 (:constants
   green_door_1 - door
   red_ball_1 - ball
   red_box_1 - box
   empty - empty_0
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0) (hold_1))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (when (and (not (locked green_door_1)) (not (or (carrying red_ball_1) (= ?obj red_box_1)))) (not (hold_1))) (when (or (carrying red_ball_1) (= ?obj red_box_1)) (hold_1)) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (when (and (not (locked green_door_1)) (not (carrying red_ball_1))) (not (hold_1))) (when (carrying red_ball_1) (hold_1)) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (when (and (not (locked green_door_1)) (not (carrying red_ball_1))) (not (hold_1))) (when (carrying red_ball_1) (hold_1)) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (when (and (not (locked green_door_1)) (not (carrying red_ball_1))) (not (hold_1))) (when (carrying red_ball_1) (hold_1)) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (when (and (not (locked green_door_1)) (not (or (= ?obj red_ball_1) (carrying red_ball_1) (and (at_ red_box_1) (not (= ?obj red_box_1)))))) (not (hold_1))) (when (or (= ?obj red_ball_1) (carrying red_ball_1) (and (at_ red_box_1) (not (= ?obj red_box_1)))) (hold_1)) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (when (and (not (locked green_door_1)) (not (or (and (carrying red_ball_1) (not (= ?obj red_ball_1))) (= ?obj red_box_1) (at_ red_box_1)))) (not (hold_1))) (when (or (and (carrying red_ball_1) (not (= ?obj red_ball_1))) (= ?obj red_box_1) (at_ red_box_1)) (hold_1)) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (when (not (or (and (not (locked ?door)) (= ?door green_door_1)) (and (locked green_door_1) (not (and (locked ?door) (= ?door green_door_1)))))) (hold_0)) (when (and (not (or (and (not (locked ?door)) (= ?door green_door_1)) (and (locked green_door_1) (not (and (locked ?door) (= ?door green_door_1)))))) (not (or (carrying red_ball_1) (at_ red_box_1)))) (not (hold_1))) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_1 room_2 room_3 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   blue_door_1 red_door_1 purple_door_1 - door
   yellow_ball_1 green_ball_1 blue_ball_1 - ball
   red_box_2 grey_box_1 green_box_1 - box
 )
 (:init (agentinroom room_4) (objectinroom red_ball_1 room_1) (objectinroom yellow_ball_1 room_1) (objectinroom green_ball_1 room_2) (objectinroom grey_box_1 room_2) (objectinroom green_box_1 room_2) (objectinroom blue_ball_1 room_2) (objectinroom red_box_1 room_3) (objectinroom red_box_2 room_4) (objectcolor red_ball_1 redtype) (objectcolor yellow_ball_1 yellowtype) (objectcolor green_ball_1 greentype) (objectcolor grey_box_1 greytype) (objectcolor green_box_1 greentype) (objectcolor blue_ball_1 bluetype) (objectcolor red_box_1 redtype) (objectcolor red_box_2 redtype) (objectcolor blue_door_1 bluetype) (objectcolor red_door_1 redtype) (objectcolor purple_door_1 purpletype) (objectcolor green_door_1 greentype) (emptyhands) (locked blue_door_1) (locked red_door_1) (locked purple_door_1) (locked green_door_1) (adjacentrooms room_2 room_1 blue_door_1) (adjacentrooms room_1 room_2 blue_door_1) (adjacentrooms room_3 room_1 red_door_1) (adjacentrooms room_1 room_3 red_door_1) (adjacentrooms room_4 room_2 purple_door_1) (adjacentrooms room_2 room_4 purple_door_1) (adjacentrooms room_4 room_3 green_door_1) (adjacentrooms room_3 room_4 green_door_1) (visited room_4) (hold_1) (= (total-cost) 0))
 (:goal (and (exists (?d - door)
 (and (objectcolor ?d redtype) (at_ ?d) (not (locked ?d)))) (hold_0) (hold_1)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor green_door_1 room_4 room_3)
   added: (at_ green_door_1)
   goals met: 1 of 3
2. (toggle green_door_1)
   deleted: (locked green_door_1) (hold_1)
   added: (hold_0)
   goals met: 1 of 3
3. (gotoroom room_4 room_3 green_door_1)
   deleted: (agentinroom room_4) (at_ green_door_1)
   added: (agentinroom room_3) (visited room_3)
   goals met: 1 of 3
4. (gotodoor green_door_1 room_3 room_4)
   added: (at_ green_door_1)
   goals met: 1 of 3
5. (toggle green_door_1)
   added: (locked green_door_1)
   goals met: 1 of 3
6. (gotoobject red_box_1 room_3)
   deleted: (at_ green_door_1)
   added: (at_ red_box_1) (hold_1)
   goals met: 2 of 3
7. (gotodoor red_door_1 room_3 room_1)
   deleted: (at_ red_box_1)
   added: (at_ red_door_1)
   goals met: 2 of 3
8. (toggle red_door_1)
   deleted: (locked red_door_1)
   goals met: 3 of 3
